sourceCode/backend/controllers/EventsController.php

INSERT INTO `events` (`user_id`, `category_id`, `title`, `description`, `quota`, `numOfPart`, `date`, `lng`, `ltd`) VALUES (1, 1, 'Lets play football', '<p><span style=\"color:rgb(34, 34, 34); font-family:sans-serif; font-size:14px\">Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.</span></p>\r\n', 10, NULL, NULL, 47.9083, 19.048)
---
    public function actionCreate()
    {
        $model = new Events();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `events` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Events::findOne($id)) !== null) {