sourceCode/backend/views/events/_form.php

SELECT * FROM `user`
SELECT * FROM `category`
---

    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'user_id')->dropDownList(
        ArrayHelper::map(\common\models\User::find()->all(),'id','name'),
        [
            'prompt' => 'Organizer',
        ]
    );?>

    <?= $form->field($model, 'category_id')->dropDownList(
        ArrayHelper::map(\backend\models\Category::find()->all(),'id','title'),
        [
            'prompt' => 'Category',
        ]
    );?>